Enums/ПолФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПолФизическихЛиц</Name>
			<Comment>Пол физических лиц</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУказан</Name>
					<Comment>Пол не указан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>Пол мужской</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>Пол женский</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДокументов</Name>
			<Comment>Виды подтверждающих документов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сертификат</Name>
					<Comment>Сертификат</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвидетельствоОРегистрацииТС</Name>
					<Comment>Свидетельство о регистрации ТС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Свидетельство</Name>
					<Comment>Свидетельство о государственной регистрации индивидуального предпринимателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лицензия</Name>
					<Comment>Лицензия</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паспорт</Name>
					<Comment>Общегражданский паспорт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удостоверение</Name>
					<Comment>Удостоверение личности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доверенность</Name>
					<Comment>Доверенность</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВоенныйБилет</Name>
					<Comment>Военный билет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справка</Name>
					<Comment>Справка (например об освобождении)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПТС</Name>
					<Comment>Паспорт транспортного средства</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныйПТС</Name>
					<Comment>Электронный паспорт транспортного средства</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АттестатТО</Name>
					<Comment>Аттестат аккредитации оператора технического осмотра транспортных средств</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидНаЖительствоИностранногоГражданина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВодительскоеУдостоверение</Name>
					<Comment>Вид документа водительское удостоверение </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий документ удостоверяющий личность</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Устав</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПодтверждающиеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПодтверждающиеДокументы</Name>
			<Comment>Данные всех подтверждающих документов по всем объектам</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
				<xr:Item>Catalog.Автомобили</xr:Item>
				<xr:Item>Catalog.ПодразделенияКомпании</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПодтверждающегоДокумента</Name>
					<Comment>Вид подтверждающего документа</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Comment>Серия документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Comment>Дата выдачи подтверждающего документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КемВыдан</Name>
					<Comment>Кем выдан подтверждающий документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБланка</Name>
					<Comment>Номер бланка подтверждающего документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текущий</Name>
					<Comment>Признак того, что документ актуален в данный момент</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Устаревший</Name>
					<Comment>Признак того, что документ устарел и не используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДоверенности</Name>
					<Comment>Паспорт или др. удостоверение личности для доверенности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик, от которого получают материальные ценности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Comment>Номер документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лицензия</Name>
					<Comment>Лицензия фирмы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания срока действия подтверждающего документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВРеестреОператоровТО</Name>
					<Comment>Номер в реестре операторов технического осмотра</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа, всегда рубли.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПодразделения</Name>
					<Comment>Код подразделения в паспорте</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаДокументаУдостоверяющегоЛичность</Name>
					<Comment>Код вида документа удостоверяющего личность</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Таблица товаров и услуг</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтажПоКатегориямТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияТС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КатегорииТранспортныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПолучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ЗаявлениеНаСертификатАльфаАвто/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// См. ЗаявлениеНаСертификатПереопределяемый.ПриЗаполненииРеквизитовОрганизацииВЗаявленииНаСертификат
Процедура ПриЗаполненииРеквизитовОрганизацииВЗаявленииНаСертификат(Параметры) Экспорт

	Если Не ЗначениеЗаполнено(Параметры.Организация) Тогда
		
		Параметры.Организация = ПараметрыСеанса.Организация;
		
	КонецЕсли;
	
	СведенияОбОрганизации = ОрганизацииСервер.СведенияОбОрганизации(Параметры.Организация);
	
	Параметры.ЭтоИндивидуальныйПредприниматель = СведенияОбОрганизации.ЭтоФизическоеЛицо;
	Параметры.НаименованиеСокращенное = СведенияОбОрганизации.НаименованиеСокращенное;
	Параметры.НаименованиеПолное = СведенияОбОрганизации.НаименованиеПолное;
	Параметры.ИНН = СведенияОбОрганизации.ИНН;
	Параметры.КПП = СведенияОбОрганизации.КПП;
	Параметры.ОГРН = СведенияОбОрганизации.ОГРН;
	 
	Параметры.РасчетныйСчет         = СведенияОбОрганизации.БанковскийСчетНомерСчета;
	Параметры.БИК                   = СведенияОбОрганизации.БанковскийСчетБИК;
	Параметры.КорреспондентскийСчет = СведенияОбОрганизации.БанковскийСчетКоррСчет;
	
	// В СведенияОбОрганизации контактная информация союержится только строкой, а нам нужено в формате JSON.
	// И в СведенияОбОрганизации нет телефона
	ВидыКИ = Новый Массив;
	ВидыКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	ВидыКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	ВидыКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
	
	КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметры.Организация),
		,
		ВидыКИ,
		ТекущаяДатаСеанса()
	);
	
	НайденныеСтроки = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид",
		Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Параметры.Телефон = НайденныеСтроки[0].Значение;
		
	КонецЕсли;
	
	НайденныеСтроки = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид",
		Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Параметры.ЮридическийАдрес = НайденныеСтроки[0].Значение;
		
	КонецЕсли;
	
	НайденныеСтроки = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид",
		Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Параметры.ФактическийАдрес = НайденныеСтроки[0].Значение;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается в форме добавления заявления на новый сертификат для заполнении реквизитов владельца и при его выборе.
//
// Параметры:
//  Параметры - Структура:
//    * Организация  - ОпределяемыйТип.Организация - выбранная организация, на которую оформляется сертификат.
//                   - Неопределено - если ОпределяемыйТип.Организация не настроен.
//
//    * ТипВладельца  - ОписаниеТипов - (возвращаемое значение) содержит ссылочные типы, из которых можно сделать выбор.
//                    - Неопределено  - (возвращаемое значение) выбор владельца не поддерживается.
//
//    * Сотрудник    - ТипВладельца - (возвращаемое значение) - это владелец сертификата, которого нужно заполнить.
//                     Если уже заполнен (выбран пользователем), его не следует изменять.
//                   - Неопределено - если ТипВладельца не определен, тогда реквизит не доступен пользователю.
//
//    * Директор     - ТипВладельца - (возвращаемое значение) - это директор, который может быть выбран,
//                     как владелец сертификата.
//                   - Неопределено - начальное значение - скрыть директора из списка выбора.
//
//    * ГлавныйБухгалтер - ТипВладельца - (возвращаемое значение) это главный бухгалтер, который может быть выбран
//                     как владелец сертификата.
//                   - Неопределено - начальное значение - скрыть главного бухгалтера из списка выбора.
//
//    * Пользователь - СправочникСсылка.Пользователи - (возвращаемое значение) пользователь - владелец сертификата.
//                     В общем случае может быть не заполнено. Рекомендуется заполнить, если есть возможность.
//                     Записывается в сертификат в поле Пользователь, может быть изменено в дальнейшем.
//
//    * Фамилия            - Строка - (возвращаемое значение) фамилия сотрудника.
//                         - Неопределено - значение не указано, не изменять имеющееся значение.
//
//    * Имя                - Строка - (возвращаемое значение) имя сотрудника.
//                         - Неопределено - значение не указано, не изменять имеющееся значение.
//
//    * Отчество           - Строка - (возвращаемое значение) отчество сотрудника.
//                         - Неопределено - значение не указано, не изменять имеющееся значение.
//
//    * ДатаРождения       - Дата   - (возвращаемое значение) дата рождения сотрудника.
//                         - Неопределено - значение не указано, не изменять имеющееся значение.
//
//    * Пол                - Строка - (возвращаемое значение) пол сотрудника "Мужской" или "Женский".
//                         - Неопределено - значение не указано, не изменять имеющееся значение.
//
//    * МестоРождения      - Строка - (возвращаемое значение) описание места рождения сотрудника.
//                         - Неопределено - значение не указано, не изменять имеющееся значение.
//
//    * Гражданство        - СправочникСсылка.СтраныМира - (возвращаемое значение) гражданство сотрудника.
//                         - Неопределено - значение не указано, не изменять имеющееся значение.
//
//    * СтраховойНомерПФР  - Строка - (возвращаемое значение) СНИЛС сотрудника.
//                         - Неопределено - значение не указано, не изменять имеющееся значение.
//
//    * Должность          - Строка - (возвращаемое значение) должность сотрудника в организации.
//                         - Неопределено - значение не указано, не изменять имеющееся значение.
//
//    * Подразделение      - Строка - (возвращаемое значение) обособленное подразделение организации,
//                           в котором работает сотрудник.
//                         - Неопределено - значение не указано, не изменять имеющееся значение.
//
//
//    * ДокументВид        - Строка - (возвращаемое значение) строки "21" или "91". 21 - паспорт гражданина РФ,
//                           91 - иной документ, предусмотренный законодательством РФ (по СПДУЛ).
//                         - Неопределено - значение не указано, не изменять имеющееся значение.
//
//
//    * ДокументНомер      - Строка - (возвращаемое значение) номер документа сотрудника (серия и
//                           номер для паспорта гражданина РФ).
//                         - Неопределено - значение не указано, не изменять имеющееся значение.
//
//
//    * ДокументКемВыдан   - Строка - (возвращаемое значение) кем выдан документ сотрудника.
//                         - Неопределено - значение не указано, не изменять имеющееся значение.
//
//
//    * ДокументКодПодразделения - Строка - (возвращаемое значение) - код подразделения, если вид документа 21.
//                               - Неопределено - значение не указано, не изменять имеющееся значение.
//
//
//    * ДокументДатаВыдачи - Дата   - (возвращаемое значение) дата выдачи документа сотрудника.
//                         - Неопределено - значение не указано, не изменять имеющееся значение.
//
//
//    * ЭлектроннаяПочта   - Строка - (возвращаемое значение) адрес электронной почты сотрудника в формате XML, как его
//                           возвращает функция КонтактнаяИнформацияВXML общего модуля УправлениеКонтактнойИнформацией.
//                         - Неопределено - значение не указано, не изменять имеющееся значение.
//
//
Процедура ПриЗаполненииРеквизитовВладельцаВЗаявленииНаСертификат(Параметры) Экспорт
	
	ЗаполнитьДоступныхКВыборуВладельцев(Параметры);
	
	Если Не ЗначениеЗаполнено(Параметры.Сотрудник) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьДанныеВладельца(Параметры);
	ЗаполнитьДанныеДокументаВладельца(Параметры);
	ЗаполнитьКонтактнуюИнформациюВладельца(Параметры);
	
КонецПроцедуры

// См. ЗаявлениеНаСертификатПереопределяемый.ПриЗаполненииРеквизитовРуководителяВЗаявленииНаСертификат
Процедура ПриЗаполненииРеквизитовРуководителяВЗаявленииНаСертификат(Параметры) Экспорт
	
	Руководитель = ОрганизацииАльфаАвто.Руководитель(Параметры.Организация);
	
	Если ЗначениеЗаполнено(Руководитель) Тогда
		
		Параметры.ТипРуководителя = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
		Параметры.Руководитель    = Руководитель;
		
		РеквизитыРуководителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Руководитель, "Наименование,Должность");
		
		Параметры.Представление = РеквизитыРуководителя.Наименование;
		Параметры.Должность     = Строка(РеквизитыРуководителя.Должность);
		Параметры.Основание     = НСтр("ru = 'Устав'");
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДоступныхКВыборуВладельцев(Параметры)
	
	Параметры.ТипВладельца = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
	
	Если Не ЗначениеЗаполнено(Параметры.Директор) Тогда
		
		Параметры.Директор = ОрганизацииАльфаАвто.Руководитель(Параметры.Организация);
		
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(Параметры.ГлавныйБухгалтер) Тогда
		
		Параметры.ГлавныйБухгалтер = ОрганизацииАльфаАвто.ГлавныйБухгалтер(Параметры.Организация);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.Сотрудник) Тогда
		
		Параметры.Сотрудник = Параметры.Директор;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеВладельца(Параметры)
	
	РеквизитыСотрудника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Сотрудник,
		"Наименование,ДатаРождения,Пол,Должность");
	
	ЗаполнитьЗначенияСвойств(Параметры, ПолучитьФИО(РеквизитыСотрудника.Наименование));
	
	Параметры.ДатаРождения  = РеквизитыСотрудника.ДатаРождения;
	Параметры.Должность     = Строка(РеквизитыСотрудника.Должность);
	Параметры.МестоРождения = "Россия";
	Параметры.Гражданство   = Справочники.СтраныМира.Россия;
	
	Если РеквизитыСотрудника.Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда
		
		Параметры.Пол = "Мужской";
		
	ИначеЕсли РеквизитыСотрудника.Пол = Перечисления.ПолФизическихЛиц.Женский Тогда
		
		Параметры.Пол = "Женский";
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьФИО(Текст)
	
	Текст = СокрЛП(Текст);
	Пока СтрЧислоВхождений(Текст, "  ") > 0 Цикл
		Текст = СтрЗаменить(Текст, "  ", " ");
	КонецЦикла;
	
	ФИО = Новый Структура;
	
	ЧислоСимволов      = СтрДлина(Текст);
	КоличествоПробелов = СтрЧислоВхождений(Текст, " "); 
	
	Если КоличествоПробелов = 0 Тогда
		ПервыйПробел    = ЧислоСимволов;
		ПоследнийПробел = ЧислоСимволов;
	ИначеЕсли КоличествоПробелов = 1 Тогда
		ПервыйПробел = СтрНайти(Текст, " ", НаправлениеПоиска.СНачала);
		ПоследнийПробел = ЧислоСимволов;
	Иначе
		ПервыйПробел = СтрНайти(Текст, " ", НаправлениеПоиска.СНачала);
		ПоследнийПробел = СтрНайти(Текст, " ", НаправлениеПоиска.СКонца);
	КонецЕсли;
	
	Фамилия  = ТРег(СокрЛП(Сред(Текст, 0, ПервыйПробел)));
	Имя      = ТРег(СокрЛП(Сред(Текст, ПервыйПробел    + 1, ПоследнийПробел  - ПервыйПробел    ))); 
	Отчество = ТРег(СокрЛП(Сред(Текст, ПоследнийПробел + 1, ЧислоСимволов    - ПоследнийПробел )));
	
	ФИО.Вставить("Фамилия", Фамилия);
	ФИО.Вставить("Имя", Имя);
	ФИО.Вставить("Отчество", Отчество);
	
	Возврат ФИО;
	
КонецФункции

Процедура ЗаполнитьДанныеДокументаВладельца(Параметры)
	
	ПаспортСотрудника = ПаспортСотрудника(Параметры.Сотрудник);
	
	Если ПаспортСотрудника <> Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(Параметры, ПаспортСотрудника);
		
	КонецЕсли;

КонецПроцедуры

Функция ПаспортСотрудника(Сотрудник)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПодтверждающиеДокументы.Ссылка КАК Паспорт,
		|	""21"" КАК ДокументВид,
		|	ПодтверждающиеДокументы.Серия + "" "" + ПодтверждающиеДокументы.Номер КАК ДокументНомер,
		|	ПодтверждающиеДокументы.КемВыдан КАК ДокументКемВыдан,
		|	ПодтверждающиеДокументы.КодПодразделения КАК ДокументКодПодразделения,
		|	ПодтверждающиеДокументы.ДатаВыдачи КАК ДокументДатаВыдачи
		|ИЗ
		|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
		|ГДЕ
		|	ПодтверждающиеДокументы.Владелец = &Владелец
		|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &ВидПодтверждающегоДокумента"
	);
	Запрос.УстановитьПараметр("Владелец", Сотрудник);
	Запрос.УстановитьПараметр("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.Паспорт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);

КонецФункции

Процедура ЗаполнитьКонтактнуюИнформациюВладельца(Параметры)
	
	КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		Параметры.Сотрудник,
		Справочники.ВидыКонтактнойИнформации.EmailСотрудника,
		ТекущаяДатаСеанса(),
		Ложь
	);
	
	Если КонтактнаяИнформация.Количество() > 0 Тогда
		
		Параметры.ЭлектроннаяПочта = КонтактнаяИнформация[0].Значение;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
